## Data Analyst Test

#### General SQL Skills

You have a `sales` relational table that stores the simplified sales information of a given company. The table has the following `CREATE DDL` 

```mysql
CREATE TABLE `sales` (
  `order_id` varchar(32) NOT NULL,
  `username` varchar(64) NOT NULL,
  `order_date` datetime NOT NULL,
  `product_id` varchar(32) NOT NULL,
  `product_name` varchar(256) NOT NULL,
  `total_amount` decimal(6,2) NOT NULL,
  PRIMARY KEY (`order_id`),
  KEY `sales_idx_product_id` (`purchased_product_id`),
  KEY `sales_idx_username` (`client_username`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
```

The fields are self explainatory: they just represent **when** an order was made, **who** is the customer, **which** product they bought and the **amount** of the order.

This is a sample extract of this over simplified model:

**Table A**

| order_id | date                | username     | product_name  | total_amount |
| -------- | ------------------- | ------------ | ------------- | ------------ |
| 42-49    | 2019-07-01 15:05:25 | bob@me.com   | Ipad mini     | 449          |
| 78-12    | 2019-07-03 11:42:54 | jane@me.com  | **Ipad pro**  | 879          |
| 18-92    | 2019-07-01 17:22:10 | alice@me.com | **Ipad pro**  | 879          |
| 61-14    | 2019-06-02 10:11:43 | joe@me.com   | Ipad mini     | 449          |
| 84-34    | 2019-06-10 12:11:32 | bob@me.com   | AirPods       | 179          |
| 22-25    | 2019-05-15 15:10:10 | jane@me.com  | **Iphone Xs** | 939          |
| 52-49    | 2019-05-20 13:01:01 | joe@me.com   | Iphone 8      | 569          |
|          |                     |              |               |              |



The company wants an insight on the sales of the top Apple products the **Ipad pro** and the **Iphone Xs**, **aggregated by month**, so the first thing to do is to find a way to transform the table above into the following format:

**Table B**

| month | Ipad_pro_total | Iphone_xs_total | other_total |
| ----- | -------------- | --------------- | ----------- |
| 05    | 0              | 939             | 569         |
| 06    | 0              | 0               | 628         |
| 07    | 1758           | 0               | 449         |



**Questions**:

* Describe, using SQL statements, how you would transform **Table A** into **Table B**
* Would you use materialized tables or SQL Views?
* Is it possible to do this transformation using a single SQL statement?
* How would the transformation change if we wanted to group the sales by **week number**? And using the **name** of the month (ie. `July` instead of the **number** of the month `07`) ?



#### Data transformation and visualization

Given the example above, elaborate a short essay (15-20 sentences) where you answer the following:

* What kind of general-purpose analytic tools, programming languages or framework, scripting or data modeling tools you see fit to solve this particular task?
* What is your opinion on the `ETL` vs `ELT` dilemma? (hint: a quick Google search will shed some light)
* How would you visually present the results in **Table B**? What tool would you use for its visualization?


<font size = 5>
<h1><center> Questions </center></h1>
</font>

<br>
<br>
<font size =5>
1. Describe, using SQL statements, how you would transform Table A into Table B

</font>

<br>
<br>

&nbsp;&nbsp;&nbsp;&nbsp; I'll go step by step while explaining my thought process behind every query 


<BR>

```mysql
SELECT strftime('%m',ORDER_DATE) AS months ,(SELECT 
(CASE WHEN PRODUCT_NAME = 'Iphone 8' or PRODUCT_NAME = 'Airpods'or PRODUCT_NAME = 'Ipad mini' 
 THEN 'Others' ELSE PRODUCT_NAME END)
 AS PRODUCT_NAME ) AS PRODUCTS ,  SUM(TOTAL_AMOUNT)
 FROM SALES2 
 GROUP BY PRODUCTS, months
 ORDER BY months

```

<br>

&nbsp;&nbsp;&nbsp;&nbsp;Gives me the following output : 



| months | PRODUCTS      |  SUM(TOTAL_AMMOUNT) |
| ----- | -------------- | ---------------     | 
| 05    |  IphoneXs      | 939                 |          
| 05    |  Others        | 569                 |          
| 06    |  Others        | 628                 |          
| 07    |  Ipad pro      | 1758                | 
| 07    |  Others        | 449                 | 


<br>

&nbsp;&nbsp;&nbsp;&nbsp; What I did there was basically select the month from the datetime variable and "rename" everything that's not an IphoneXs or an Ipad Pro to the others category, finnaly sum the total amount **grouped by product and  month** , the month is crucial otherwise it will sum the amount and assigned it to the last month when "others" category got purchased , in this case would sum every others into month 7.   <br>

&nbsp;&nbsp;&nbsp;&nbsp; Now that I have this it's just a matter of pivoting the data ,there's no pivot function in SQLlite (SQL version I'm using ), but the same can be achieve with case statements.


&nbsp;&nbsp;&nbsp;&nbsp;I created a view in order to make the query more readable

<br>

```mysql  
CREATE VIEW pivot_view AS 
 	
    SELECT strftime('%m',ORDER_DATE) AS months ,(SELECT (CASE WHEN PRODUCT_NAME = 'Iphone 8'
    OR PRODUCT_NAME = 'Airpods' OR PRODUCT_NAME = 'Ipad mini' THEN 'Others' ELSE PRODUCT_NAME END)
    AS PRODUCT_NAME ) AS PRODUCTS ,  SUM(TOTAL_AMOUNT) AS TOTAL_AMOUNT
    FROM SALES2 
    GROUP BY PRODUCTS,months
    ORDER BY months
        
    
```    
<br>

&nbsp;&nbsp;&nbsp;&nbsp; Now we pivot the data:

<br>

```mysql  

SELECT months, 
		 sum(case when PRODUCTS = 'Ipad pro' then Total_Amount end ) as Ipad_pro_Total
		,sum(case when PRODUCTS = 'Iphone Xs' then Total_Amount end ) as Iphone_XS_Total
		,sum(case when PRODUCTS = 'Others' then Total_Amount end ) as other_total
FROM pivot_view
GROUP by MONTHS

```

<br>

&nbsp;&nbsp;&nbsp;&nbsp;And we get the desired Table B output :


| month | Ipad_pro_total | Iphone_xs_total | other_total |
| ----- | -------------- | --------------- | ----------- |
| 05    | 0              | 939             | 569         |
| 06    | 0              | 0               | 628         |
| 07    | 1758           | 0               | 449         |

<br>

<br>
<br>
<br>
<br>


<font size =5>
2. Would you use materialized tables or SQL Views? 

</font>

<br>
<br>

&nbsp;&nbsp;&nbsp;&nbsp;A view is just a stored SQL statement , it's much different from than an actual materialized table, which has it's benefits such as less memory expensive and security.<br>
&nbsp;&nbsp;&nbsp;&nbsp;One drawback of using views is that you lose information about relations (primary keys, foreign keys).

<br>

&nbsp;&nbsp;&nbsp;&nbsp;However none of  the the SQL statements I used , required any columns with a key assigned to it, we can see that we only used ORDER_DATE , PRODUCT_NAME , TOTAL_AMOUNT columns, and none of them has any key, so for this specific case I believe to be better use a view instead of a materialized table  


<br>
<br>
<br>
<br>


<font size =5>
3. Would you use materialized tables or SQL Views? 

</font>

<br>
<br>